IDEA Open Model
ProjectDataConcrete Class
Compatible with IDEA StatiCa 20.1
 Project data concrete
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Concrete.ProjectDataConcrete
 IdeaRS.OpenModel.Concrete.ProjectDataConcreteEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class ProjectDataConcrete : OpenObject
Public MustInherit Class ProjectDataConcrete
	Inherits OpenObject
The ProjectDataConcrete type exposes the following members.
Constructors
Name | Description
ProjectDataConcrete
 Constructor
Top
Properties
Name | Description
DesignWorkingLife
 Design working fife
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace